# Seed notebook to read and manipulate data with pandas and numpy

Read from a .csv file, parsing dates

In [1]:
import pandas as pd
df = pd.read_csv("employees.csv", parse_dates=["hire date"])
df

   first name    last name  hire date  salary education level
0      Albert     Einstein 1998-01-01    8000             PhD
1      Blaise       Pascal 1999-02-02    6000              BS
2      Edmond       Halley 2000-03-03    5800     High school
3      Enrico        Fermi 2000-04-04    5600             MsC
4       Marie         Curi 2001-05-05    7200             PhD
5         Max       Planck 2001-06-06    4900     High school
6    Nicolaus   Copernicus 2002-07-07    5100              BS
7       Niels         Bohr 2002-08-08    5400             MsC
8     Richard      Feynman 2002-09-09    7800             PhD
9       Isaac       Newton 2003-10-10    7100              BS
10    Stephen      Hawking 2004-11-11    7400             PhD

Create a new column, based on values of another column

In [2]:
import numpy as np
df['high salary'] = np.where(df['salary'] >= 7000,'high','low')
df

   first name    last name  hire date  salary education level high salary
0      Albert     Einstein 1998-01-01    8000             PhD        high
1      Blaise       Pascal 1999-02-02    6000              BS         low
2      Edmond       Halley 2000-03-03    5800     High school         low
3      Enrico        Fermi 2000-04-04    5600             MsC         low
4       Marie         Curi 2001-05-05    7200             PhD        high
5         Max       Planck 2001-06-06    4900     High school         low
6    Nicolaus   Copernicus 2002-07-07    5100              BS         low
7       Niels         Bohr 2002-08-08    5400             MsC         low
8     Richard      Feynman 2002-09-09    7800             PhD        high
9       Isaac       Newton 2003-10-10    7100              BS        high
10    Stephen      Hawking 2004-11-11    7400             PhD        high

Add the column again, this time using list comprehension

In [3]:
# First drop the column we just added (test first, in case this cell
# is executed more than once)
if 'high salary' in df.columns:
    df.drop('high salary', axis=1, inplace=True)

# Add it again using list comprehension
df['high salary'] = ['high' if x >= 7000 else 'low' for x in df['salary']]
df

   first name    last name  hire date  salary education level high salary
0      Albert     Einstein 1998-01-01    8000             PhD        high
1      Blaise       Pascal 1999-02-02    6000              BS         low
2      Edmond       Halley 2000-03-03    5800     High school         low
3      Enrico        Fermi 2000-04-04    5600             MsC         low
4       Marie         Curi 2001-05-05    7200             PhD        high
5         Max       Planck 2001-06-06    4900     High school         low
6    Nicolaus   Copernicus 2002-07-07    5100              BS         low
7       Niels         Bohr 2002-08-08    5400             MsC         low
8     Richard      Feynman 2002-09-09    7800             PhD        high
9       Isaac       Newton 2003-10-10    7100              BS        high
10    Stephen      Hawking 2004-11-11    7400             PhD        high

Which method to use: [this StackOverflow question](https://stackoverflow.com/q/50375985/336802) says that the `numpy` method is faster for large dataset.